your_lang = 'Это твой язык'

help = 'Если вам нужна помощь или подсказка, пишите ➡️ @lenkkey'

wrong_ans = ["""Похоже, твои мысли сейчас куда-то спешат и путаются! Давай спокойно подумаем ещё раз.""",
             """Этот ответ неверный. Но даже олимпийские чемпионы когда-то путали термины. Главное — ты в игре, как настоящий триатлет!""",
             """Ой-ой, кажется, ты уплыл не в ту сторону! Давай попробуем ещё разок 🏊""",
             """Горячо! Ты как велосипедист на спуске — мчишься в нужном направлении, но чуть-чуть не туда свернул!""",]

wrong_btn_input = "Используй кнопку для ввода."

correct = 'Верно 👍 '

t1 = """Привет! 👋
Меня зовут Макс, и я буду твоим виртуальным помощником в Триатлон-квесте!  
"""
terms_caption = 'Но сначала небольшие формальности. Мне нужно твое согласие. Нажми на кнопку ⤵️'

t2 = """Как тебя зовут? Напиши имя, чтобы я знал, кого буду мотивировать 😁
"""
t3 = """Так, и давай на всякий случай обменяемся контактами! Оставь свой номер телефона. Обещаю не спамить мемами (ну, может, парочку 😅).
"""
enter_city = """И зафиксируем геолокацию! 📍 
Напиши свой город — будем знать, где живут наши лучшие игроки! 🗺️"""
t4 = """А теперь - твой email 📩. Пригодится для важных уведомлений (и, возможно, для секретного триатлон-этапа в будущем...). Пиши точно, как в космос, — а то письмо улетит не туда! """
email_wrong = """Хм... Кажется, здесь затесался лишний котик 🐱 Проверь, чтобы было так: example@mail.ru. """
t5 = """Всё готово! 🎉 Данные собраны, контакты на месте — теперь ты официально зарегистрирован в триатлон-квесте!
"""
t6 = """Я обожаю триатлон за бешеный микс! Ты сначала мчишься на велосипеде, потом плывёшь, как торпеда, а в конце бежишь к финишу без передышки— три вида спорта в одной гонке! Сложно? - Да! Но кайфово! 🤩
"""
t7 = """А давай проверим, сможешь ли ты стать триатлетом? Сейчас будет мини-разминка!
"""
t8 = """Триатлон — это три этапа подряд. Но я их нарочно перепутал, а ты попробуй расставить их в правильном порядке. Нажимай на кнопки внизу экрана и выбери правильную последовательность ⤵️"""
t9 = """
‼️ КАК ИСПОЛЬЗОВАТЬ КНОПКИ:
▪️При нажатии на верную кнопку появляется ✅
▪️Если ошибся, всё сбрасывается. 
▪️Количество попыток не ограничено.
"""
t10 = """Верно! Сначала вода, потом асфальт, и наконец — финиш на своих двоих! 💪

В Триатлон-квесте мы вместе пройдём три этапа, как настоящие спортсмены. Только вместо воды, велосипеда и беговой трассы у нас будут загадки и городские локации. 
Если что — я всегда подскажу и поддержу. Не зря же я здесь! 😉

Жми на кнопку внизу экрана, чтобы начать квест ⤵️
"""
t11 = """В Триатлон-квесте мы вместе пройдём три этапа, как настоящие спортсмены. Только вместо воды, велосипеда и беговой трассы у нас будут загадки и городские локации. Если что — я всегда подскажу и поддержу. Не зря же я здесь! 😉
"""
t12 = """Ты готов проверить свою смекалку и выносливость? Тогда вперёд — первый этап уже ждёт! """
t13 = """Жми на кнопку внизу экрана, чтобы начать квест ⤵️"""
t13_1 = '🏊 <b>ЭТАП 1: ПЛАВАНИЕ</b> 🏊'
t14 = """Погружаемся в первый этап — плавание! 🌊 
А ты знаешь, что без правильной экипировки далеко не уплывёшь? Давай соберем для тебя 5 предметов.

"Но чтобы их получить, нужно выполнить 5 заданий. Каждое задание скрыто за QR-кодом. Я буду тебе подсказывать, где их искать.

Жми на кнопку внизу экрана ⤵️
"""

# t16 = """Готов к первому заплыву? Тогда ныряем. Жми на кнопку внизу экрана ⤵️
# """
t17 = """‼️ <b>ПРАВИЛА ЭТАПА ПЛАВАНИЕ</b>:
🚩 Находишь QR-код (я даю подсказку) 
🚩 Сканируешь его → открываешь задание.
🚩 Выполняешь задание → пишешь ответ в бот. 
🚩 Ответил правильно → получаешь один предмет экипировки.
🚩 Собрал все 5? → Этап завершён! 👏 

Всё понятно? Жми на кнопку внизу экрана, и поплыли искать первый QR-код ⤵️
"""
# t18 = """Всё понятно? Жми на кнопку внизу экрана, и поплыли искать первый QR-код ⤵️"""
t19 = """Первый QR-код спрятан в месте, где раньше качали воду, а теперь наливают что-то покрепче. 😉 Ищи его около старой водонапорной станции (там теперь бар — не перепутай с настоящим насосом!)"""
t20 = """Когда найдёшь — жми на кнопку внизу экрана ⤵️"""
t21 = """Отлично! QR-код пойман — задание активировано! 🔥
Выполни задание и напиши ответ. Ответ - это одно слово ‼️
"""
t22 = """Точно, <b>ОЛИМПИЙКА</b>!
🏊 Это не та куртка, которую забывают в спортзале, а короткая олимпийская дистанция в триатлоне: 1.5 км плавания, 40 км вело и 10 км бега."""
t23 = """
Держи свой первый трофей — спортивные часы, которые не боятся воды! ⌚️ Теперь ты будешь отслеживать время, как настоящий профи.
"""
t24 = """Плывём дальше искать следующий QR-код? Жми на кнопку внизу экрана ⤵️
"""
t25 = """Второй QR-код ждёт тебя у здания Конторы пароходства — настоящего символа тюменского купечества! Отсюда в XIX веке купцы отправляли караваны судов с товарами по всей Сибири. 🚢
Здесь когда-то грузили чай, пушнину и металлы, а ты можешь «загрузить» себе новое здание квеста 😉 
Ищи QR-код на одной из красных металлических  конструкций со столом и деревянными лавками.
 
"""
t26 = """Нашёл код? Скорее жми кнопку внизу экрана ⤵️"""
t27 = """Отлично! QR-код пойман — задание активировано! 🔥
Выполни задание и напиши ответ. Ответ - это одно слово ‼️
"""
t28 = """Угадал! Это <b>ДРАФТИНГ</b>!
🌬️ Хитрый приём, когда ты держишься за лидером, будто тень, — и летишь вперёд, тратя меньше сил. Как умная рыбка за акулой, только без риска быть съеденным! 😉"""
t29 = """Получи гидрокостюм. Мы, триатлеты, называем его коротко - гидрач. 😎
В гидраче ты защищён от холода лучше, чем пингвин в Антарктиде! 🔥
"""
t30 = """Плывём дальше искать следующий QR-код? Жми на кнопку внизу экрана ⤵️
"""
t31 = """Следующий код ждёт тебя там, где спортсмены разминаются перед стартом! 🏋️‍♂️ Ищи его на тренировочной площадке — может быть, он притаился у турников или скамеек?"""
t32 = """Когда найдёшь — жми кнопку внизу экрана ⤵️"""
t33 = """Отлично! QR-код пойман — задание активировано! 🔥
Выполни задание и напиши ответ. Ответ - это одно слово ‼️
"""
t34 = """Да это же <b>ЛЕЖАК</b>! 
🚴‍♂️ Нет, это не про диван после работы — это аэродинамическая посадка на велосипеде. Чем ниже висишь, тем быстрее летишь. Главное — не уснуть в процессе!
"""
t35 = """Держи очки для плавания 🥽 Они защитят глаза от брызг и солнца и помогут держать курс в открытой воде. Ни бликов, ни потери обзора — только скорость и новые рекорды 💪"""
t36 = """Плывём дальше искать следующий QR-код? Жми на кнопку внизу экрана ⤵️"""
t37 = """Четвёртый QR-код ждёт тебя наверху лестницы. Там открывается классный вид на набережную и Туру — поднимайся и сканируй! 🔍

Когда найдёшь — жми кнопку внизу экрана ⤵️
"""
# t377 = """Почему? Да потому что наш город вырос из слияния десятков деревень, но при этом стал настоящим мегаполисом — вот такой парадокс! """
t38 = """Отлично! QR-код пойман — задание активировано! 🔥
Выполни задание и напиши ответ. Ответ - это одно слово ‼️
"""
t39 = """Бинго! <b>ФИНИШЁР</b> 🏆 
Это не просто тот, кто дошёл до конца. Это герой, который не свернул на последнем км к ларьку с мороженым. Ты тоже им станешь!
"""
t40 = """Ты получаешь буй для плавания 🌊  Это обязательный атрибут безопасности на открытой воде! С ним ты будешь заметен для судей и других спортсменов, даже если плывёшь на максимальной скорости 🚀"""
t41 = """Плывём дальше искать следующий QR-код? Жми на кнопку внизу экрана ⤵️
"""
t42 = """Теперь держи курс направо по улице 25 Октября ➡️ к ДК Нефтяник и фонтану. Там тебя встретит бронзовый страж Тюменьтий 🗿 Он охраняет не только воду, но и следующий QR-код.

Когда найдёшь — жми кнопку внизу экрана ⤵️
"""
t43 = """Ты уже понял, что это памятник студентам XX-XXI веков? В XX веке в Тюмени появились два легендарных института — Тюменский индустриальный институт и Тюменский инженерно-строительный институт, которые позже объединились в большой Тюменский индустриальный университет (в 2016-м). Представляешь, сколько поколений инженеров здесь выучилось?
А если пройти дальше — увидишь студентов XIX века. Тогда в Тюмени вместо университетов было реальное училище— всё серьёзно: чернильницы, перья и никаких ноутбуков! Как они вообще формулы выводили без калькуляторов?  
"""
t44 = """Выполни задание и напиши ответ. Ответ - это одно слово ‼️"""
t45 = """Верно, это <b>ТРАНЗИТКА</b>! 🏁
Это ключевое место в триатлоне, где спортсмены переходят от одного этапа гонки к другому. Не просто «переодевалка» — это святая святых триатлета! Здесь ты меняешь гидрокостюм на велоформу так быстро, будто от этого зависит твоя жизнь. Спойлер: иногда так и есть 😅
"""
t46 = """Финальный штрих — шапочка. Теперь ты выглядишь как настоящий пловец! Главное — не забыть, что это для плавания, а не для моды! 😉
"""
t47 = """Ты отлично справился с водой и собрал полный комплект: часы, гидрокостюм, очки, буй и шапочку. Теперь переключаемся на велосипед! 🚴  А для этого идем в транзитку. Помнишь же, что это?
"""
t48 = """Транзитка в нашем квесте находится на горе (в прямом смысле!). Беги туда и найди бронзового барда, который пел, что «лучше гор могут быть только...»😉 Когда будешь на месте, — жми на кнопку  ⤵️"""
t49 = """Отлично! Ты в транзитке. Здесь триатлеты пересаживаются на велосипед. 🚴  
Для триатлона тебе понадобится быстрый, технологичный велосипед — вот как у этого профи! 👇 (смотри фото)
"""
t50 = """Но сначала его нужно собрать, а каждая деталь спрятана в городе! Сейчас мы этим и займёмся 😁
Нажми на кнопку, чтобы узнать детали  ⤵️
"""
t51 = """🚴  <b>ЭТАП 2: ВЕЛОГОНКА</b> 🚴 

‼️ <b>ПРАВИЛА ЭТАПА</b>:
🚴 5 граффити-загадок — каждая указывает на место, где лежит деталь (руль, рама, колёса и т.д.).  
🚴 Угадай все места, найди их в городе и сделай там селфи 🤳🏻 
🚴 Пришли фото в бот. За каждое фото — деталь твоего велосипеда в боте!  
🚴 Собери все 5 частей — и получишь готового «железного коня» для гонки!  
"""
t52 = """‼️ Совет:
Разгадывай граффити-загадки и строй свой идеальный маршрут по городу. И да, подсказки с координатами будут, если вдруг застрянешь! 👌
"""
t53 = """Готов начать? Жми на кнопку внизу экрана ⤵️
"""

t544 = """Это граффити-загадка. Узнаёшь это место? 
Если да — беги туда быстрее ветра и сделай крутое селфи с этим объектом, после чего скинь его в бот. Покажи, что ты был тут по-настоящему! 😎📸
"""
t5444 = """⚠️ Вот координаты этой точки: ||ДЁ\\.АДЁЗЯД, ЕД\\.ДГГЯВД
Сюрприз\\! 🎁 Координаты зашифрованы буквами \\(А\\=1, Б\\=2,\\.\\.Я\\=0\\)||"""
t54 = """🆘 Вот твой аварийный пакет с координатами. Это как запасная камера: она спасает, когда совсем "прокололся". 😉 Попробуй сначала догадаться сам — так интереснее! 
"""
t55 = """🎯 Это твоя следующая цель\\. 
Сделай там селфи и скинь сюда\\. 

🗺️ Вот они, заветные цифры\\. Точнее, буквы: ||ДЁ\\.AДВЗДГ, ЕД\\.ДВЕЁЯВ
Ха\\! Ты думал, всё будет так просто? 😏 Сюрприз 🎉 — координаты зашифрованы буквами\\! Чтобы расшифровать, вспомни алфавит: А\\=1, Б\\=2\\.\\., Я\\=0 👨🏻‍🎓||
"""

photo_need = "Присылай одно фото"
t56 = """🔍 Координаты ниже — но это как энергетический гель: бери на крайняк, когда силы на исходе! А пока — попробуй догадаться сам 💡
"""
t57 = """⚠️ Для тех, кто ищет и найдет: ||ДЁ\\.AГЗДAВ, ЕД\\.ДГЯЕГA
И тут сюрприз\\! 🎁 Координаты зашифрованы буквами \\(А\\=1, Б\\=2,\\.\\.Я\\=0\\)||

"""
t58 = """🏁 Можно взять подсказку... а можно доказать, что ты — настоящий исследователь города!
"""
t59 = """🎯 Это твоя следующая цель\\. 
Сделай там селфи и скинь сюда\\. 

🗺️ Вот они, заветные цифры\\. Точнее, буквы: ||ДЁ\\.АДЁЕЕА, ЕД\\.ДВЖБЗЯ
GPS тут не поможет — только твоя смекалка\\! 🔠 В буквенных координатах А\\=1, Б\\=2\\.\\., Я\\=0||

"""
t60 = """🔍 Координаты есть... но настоящие следопыты обходятся без них! Сможешь разгадать сам? """
t61 = """🗺️ Лови координаты: ||ДЁ\\.AДЕГЕГ, ЕД\\.ДВГЁAЁ\\. Опять буквы вместо цифр\\. Но ты уже знаешь, что с ними делать 😁 На всякий случай, напомню: А\\=1, Б\\=2\\.\\., Я\\=0 ||"""
t62 = """🧠 Подсказка — как тренировочные колёса: выручает, но где драйв?"""
t63 = """⚡ Искомые координаты места:  ||ДЁ\\.AДАЯЯВ, ЕД\\.ДВЁЖГА
Неожиданно, да? 😼 Настоящие координаты — это буквенный код\\! Разгадаешь? А\\=1, Б\\=2\\.\\., Я\\=0||

"""
t64 = """Нашел все точки, сделал крутые селфи? Тогда жми на кнопку внизу и давай заканчивать этот этап с треском! Не задерживайся — впереди ещё куча драйва! 💪😎"""
t65 = """Мчись на Нулевой километр — там на Цветном бульваре будем собирать тебе велосипед по запчастям! Да-да, как конструктор, только круче! 😎

Координаты простые — не промахнёшься:
⚡ <b>57.149701, 65.540539</b> ⚡ 
Если ты правильно построил свой маршрут, то ты где-то рядом. Как будешь на месте, жми кнопку  ⤵️
"""
t66 = """Координаты простые — не промахнёшься: ⚡ 57.149701, 65.540539 ⚡ Если ты правильно построил свой маршрут, то ты где-то рядом. Как будешь на месте, жми кнопку  ⤵️"""
t67 = """Ну что, чемпион, ты нашёл все 5 деталей — теперь время для главного!
 🛠️ Собираем их в один быстрый, как молния, велосипед для триатлона! Скорее жми на кнопку, и посмотрим, что получится! ⤵️
"""
t68 = """Готово! Теперь у тебя не просто велосипед — а реактивный снаряд для триатлона! 🚀 Только не разгоняйся до световой скорости — а то финишную ленту порвёшь! 😉 
"""
t69 = """Но чтобы добрать до финишной ленты, нужно преодолеть еще один этап - БЕГ! 🏃
Это последний этап, так что выкладывайся на все сто!
Я буду болеть за тебя — представь, что я бегу рядом и кричу: «Давай, ещё чуть-чуть!»😄

Готов стартовать? Жми на кнопку ⤵️
"""

t70 = """Готов стартовать? Жми на кнопку ⤵️"""
t71 = """🏃‍♂️<b>ЭТАП 3: БЕГ 🏃‍♂️

‼️ ПРАВИЛА ЭТАПА:</b>
🏃‍♂️<b>Бежишь (или бодро идешь)</b> по моим подсказкам (я буду твоим голосовым навигатором)
🏃‍♂️<b>Находишь метки</b> (символы на зданиях или объектах) → отправляешь в бот 
🏃‍♂️<b>Если сложно</b> → жмёшь кнопку с подсказкой
🏃‍♂️<b>Засекаем время</b>  → попробуй установить личный рекорд!  
🏃‍♂️<b>Выбирай свой темп</b> → беги или иди бодрым шагом

Готов к забегу? Первая точка уже ждёт тебя! 🚀🏃‍♂️ Жми на кнопку, чтобы запустить таймер ⤵️
"""
t72 = """Готов к забегу? Первая точка уже ждёт тебя! 🚀🏃‍♂️ Жми на кнопку, чтобы запустить таймер ⤵️
"""
t73 = """Когда будешь на месте, нажми <b>"Я НА МЕСТЕ"</b>. А если заблудишься, нажми <b>"НУЖНА ПОДСКАЗКА"</b>, и я скину координаты.
Обе кнопки внизу экрана ⤵️
"""
t74 = """Лови координаты этого места: 
улица Орджоникидзе, 56/2
"""
t75 = """🔎Посмотри на здании, какая это башня, и напиши девятую букву этого прилагательного ⤵️"""
t76 = """Лови координаты этого места: 
📍ул. Хохрякова, 59 """
t77 = """🔍 Сверху на мурале есть фраза из 4 слов. Напиши первую букву первого слова этой фразы ⤵️
"""
t78 = """Готов двигаться дальше? Жми на кнопку ⤵️
"""
t79 = """Лови координаты этого места: 
📍улица Советская, 63
"""
t80 = """🔎Найди местоимение из 4 букв над главным входом с лестницей, напиши первую букву этого слова
⤵️
"""
t82 = """Готов двигаться дальше? Жми на кнопку ⤵️"""
t83 = """Лови координаты этого места: 
📍 улица Орджоникидзе, 3"""
t84 = """👀 Обрати внимание на здание по диагонали через перекрёсток — двухэтажное кирпичное, с каменной табличкой на фасаде. Найди табличку и напиши первую букву того, чем это здание является ⤵️"""
t85 = """Готов двигаться дальше? Жми на кнопку ⤵️
"""
t86 = """Лови координаты этого места:
 📍улица Масловский взвоз ||57.161422, 65.548242|| 
"""
t87 = """🔎Найди ладью и напиши третью букву в её названии ⤵️
"""
t88 = """Поздравляю! Ты нашел все метки! Теперь собери слово из полученных букв и напиши его сюда для завершения этого этапа  ⤵️
"""
t89 = """Это был бы отличный термин... для каких-нибудь других соревнований. Но в триатлоне мы называем это иначе 😄"""
t90 = """В точку! Спринт— это когда триатлон превращается в адреналиновый экспресс! 🚀 
Короткая дистанция (750 м плавание / 20 км вело / 5 км бег), но на такой скорости, что твои ноги потом спрашивают: «Эй, а где вообще финиш?» 😅 
"""
t91 = """А сейчас твои ноги должны спрашивать: «А где мои кроссовки?» А вот они! Лови классные кроссовки за прохождение этапа БЕГ."""
t92 = """Нравятся?) Теперь жми на кнопку ФИНИШ — так мы остановим твой чемпионский таймер и зафиксируем твой результат! ⏱️"""
t93 = """Ты максимально молодец! 🎉 Три этапа, куча заданий — и ты со всем справился и собрал свою идеальную экипировку! Смотри, что теперь в твоём арсенале:"""
t94 = """С таким снаряжением ты  — просто звезда триатлон-квеста! 🌟 И можешь начинать готовиться к настоящему триатлону. Смотри, как круто он проходит!! 🏊‍♂️🚴‍♂️🏃‍♂️"""
t95 = """А теперь беги за подарком на ярмарку IRONSTAR у мультицентра «Контора пароходства». 🎁 
‼️ Успей забрать свой подарок: 
<b>З июля:</b> 12:00-20:00
<b>4 июля:</b> 10:00-20:00
<b>5 июля:</b> 10:00-17:00

Найди там шатер «Информация» и нажми на кнопку ⤵️

"""
t97 = """Забирай подарок, ты его заслужил! 👏

Тебе понравилось наше триатлон-приключение? 

<b>Напиши пару строк о квесте — нам важно твоё мнение! 💙 
Твой отзыв — как GPS для будущих квестов: поможет проложить идеальный маршрут </b>😉
"""
t98 = """Ну всё, давай прощаться! Пора накатывать круги в других приключениях! 🚴‍♂️
Пусть ветер всегда будет попутным, кроссовки — быстрыми, а велосипед — без проколов! До новых стартов! 👋"""


def generate_run_reult(time_seconds):
    return f'Твой результат на этапе БЕГ: {int(time_seconds) // 60} минут {int(time_seconds) % 60} секунд '


wr = """"""

t100 = "Отлично! Для перехода в транзитку просто нажми на кнопку  ⤵️"
t101 = "Транзитка в триатлоне — это как «пересменка» между этапами, где ты превращаешься из пловца в велосипедиста, а потом — в бегуна! 🏊‍♂️→🚴‍♂️→🏃‍♂️  "
t102 = """Транзитка в триатлоне — это как «пересменка» между этапами, где ты превращаешься из пловца в велосипедиста, а потом — в бегуна! 🏊‍♂️→🚴‍♂️→🏃‍♂️  

Здесь нужно:  
✔️Быстро переодеться/сменить экипировку  
✔️Чётко разместить велосипед в своей зоне  
✔️Не забыть шлем (иначе дисквалификация!)  

P.S. В нашем квесте транзитка — это просто точка перед новым этапом, но представь, что ты на настоящем триатлоне! 😎

Для перехода в транзитку просто нажми на кнопку  ⤵️
"""
# t103 = """P.S. В нашем квесте транзитка — это просто точка перед новым этапом, но представь, что ты на настоящем триатлоне! 😎

# Для перехода в транзитку просто нажми на кнопку  ⤵️
# """

t104 ="""Админы уже проверяют твой крутой кадр! 📸 
Когда фото пройдёт проверку, ты получишь деталь велосипеда 🚴‍♂️ А пока держи следующую граффити-загадку!
"""
t105 = """Фото улетело на проверку. Когда фото пройдёт проверку, ты получишь деталь велосипеда 🚴‍♂️
А сейчас ты можешь разгадывать следующую граффити-загадку! 
"""
# t106 = """Когда фото пройдёт проверку, ты получишь деталь велосипеда 🚴‍♂️"""

t107 ="""А теперь напиши последнюю букву последнего слова этой фразы ⤵️"""

t108 = """Кадр — огонь! 📸  Админы перепроверят твое фото на финише, но я тебе доверяю. Деталь велосипеда твоя — забирай и кати дальше! 🚴‍♂️"""

t109 = """Супер! Фото чёткое, место узнаваемое. На финише сверим, но я спокоен. Лови запчасть и вперёд!💨"""

t110 = """Красавчик! Объект в кадре, как по заказу. Админы глянут позже, а ты забирай деталь и не сбавляй обороты! 🔥
"""

t111 = """Снято! Админы проверят, но у меня сомнений нет — ты там был. Держи деталь и крути педали дальше! 🎯"""

t112 = """Принято! Админы всё увидят на финише, а пока забирай деталь и продолжай свой триатлон! 💪🏁"""